---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.InvalidOperationException
source: html/feed9624-7dc7-259f-3ed1-076f959494c6.htm
---
# InvalidOperationException Methods

Retrieves data needed to serialize the target object.